#### Terraform Plan

<details><summary>Show Plan</summary>

```
aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsLICENSEtxt_CF173BC8: Refreshing state... [id=/static/js/main.f4c8898c.js.LICENSE.txt]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF: Refreshing state... [id=terraform-20230803215115569800000002]
data.aws_region.Region: Reading...
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5: Refreshing state... [id=terraform-20230727204725916100000001]
aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjs_7B16084A: Refreshing state... [id=/static/js/main.f4c8898c.js]
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsmap_0538E57B: Refreshing state... [id=/static/js/main.f4c8898c.js.map]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_dynamodb_table.VotingAppStore_Items_tfawsdynamodbTableDynamodbTable_3639CE64: Refreshing state... [id=Items-591d973a]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47: Refreshing state... [id=terraform-20230808003212924500000001]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA: Refreshing state... [id=terraform-20230803215115569800000002-20230803215115890800000004]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97: Refreshing state... [id=terraform-20230803215115569800000002:terraform-20230803215115813700000003]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1: Refreshing state... [id=terraform-20230727204725916100000001-20230727204726450200000003]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E: Refreshing state... [id=terraform-20230727204725916100000001:terraform-20230727204739773400000005]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320: Refreshing state... [id=terraform-20230808003212924500000001-20230808003213158800000002]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9: Refreshing state... [id=terraform-20230808003212924500000001:terraform-20230808003225755300000003]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9: Refreshing state... [id=asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.3426b4ea146ca83ace315aab04de7422.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004: Refreshing state... [id=asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.7569576cf4840d62ce55c8441a4f446e.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6: Refreshing state... [id=asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.497f52908aa0b79581673064be144ac9.zip]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9077b8c189ebb7efeec6089fca97f701.zip]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_bucket_public_access_block.cloudWebsite_PublicAccessBlock_18A70311: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2css_F3967298: Refreshing state... [id=/static/css/main.e6c13ad2.css]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2cssmap_DFBF7C37: Refreshing state... [id=/static/css/main.e6c13ad2.css.map]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E1QUV69RQ9ODON]
aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289: Refreshing state... [id=VotingAppApi-OnRequest-41f14472-c87bddf9]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52: Refreshing state... [id=VotingAppApi-OnRequest-8d2e75ec-c8cf8e09]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6: Refreshing state... [id=VotingAppApi-OnRequest-52bc3c17-c89daf14]
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Reading...
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Read complete after 0s [id=573591717]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=dfh6uhtoa0]
aws_lambda_permission.VotingAppApi_api_permission-GET-60cabf0c_A106D13D: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-60cabf0c]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=1e60l0]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-dfh6uhtoa0-prod]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-08-08T00:47:51.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:6" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:6/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9077b8c189ebb7efeec6089fca97f701.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.7211f168e2c481eed7ceaeea03c994be.zip"
        tags                           = {}
      ~ version                        = "6" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
        id                             = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      ~ last_modified                  = "2023-08-08T00:47:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:5/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.3426b4ea146ca83ace315aab04de7422.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.2ec7254f0532649728f6867fdc3cd84a.zip"
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6" {
        id                             = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      ~ last_modified                  = "2023-08-08T00:47:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:2" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:2/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.497f52908aa0b79581673064be144ac9.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.37e2aad5a96fe2728ea9c1b2fb95e3b3.zip"
        tags                           = {}
      ~ version                        = "2" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
        id                             = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      ~ last_modified                  = "2023-08-08T00:47:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:4/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.7569576cf4840d62ce55c8441a4f446e.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.f434540f652ecd4bf655bd3c4b7f8fcd.zip"
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "33ad921795a15d64fb311f7f3177af85" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9077b8c189ebb7efeec6089fca97f701.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9077b8c189ebb7efeec6089fca97f701.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.7211f168e2c481eed7ceaeea03c994be.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/9077B8C189EBB7EFEEC6089FCA97F701/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/7211F168E2C481EED7CEAEEA03C994BE/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a8fa08f28f8c67a47b983b8e93a4611e" -> (known after apply)
      ~ id                     = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.3426b4ea146ca83ace315aab04de7422.zip" -> (known after apply)
      ~ key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.3426b4ea146ca83ace315aab04de7422.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.2ec7254f0532649728f6867fdc3cd84a.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/3426B4EA146CA83ACE315AAB04DE7422/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/2EC7254F0532649728F6867FDC3CD84A/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "4e36991b10ed3abf396e7b760cd60304" -> (known after apply)
      ~ id                     = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.497f52908aa0b79581673064be144ac9.zip" -> (known after apply)
      ~ key                    = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.497f52908aa0b79581673064be144ac9.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.37e2aad5a96fe2728ea9c1b2fb95e3b3.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/497F52908AA0B79581673064BE144AC9/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/37E2AAD5A96FE2728EA9C1B2FB95E3B3/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "5ae08a19a7fc78eb4144c925e0942cc6" -> (known after apply)
      ~ id                     = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.7569576cf4840d62ce55c8441a4f446e.zip" -> (known after apply)
      ~ key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.7569576cf4840d62ce55c8441a4f446e.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.f434540f652ecd4bf655bd3c4b7f8fcd.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/7569576CF4840D62CE55C8441A4F446E/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/F434540F652ECD4BF655BD3C4B7F8FCD/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsLICENSEtxt_53FD4040 will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--main26fc20fajsLICENSEtxt_53FD4040" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.26fc20fa.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.26fc20fa.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--main26fc20fajs_8317AB8C will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--main26fc20fajs_8317AB8C" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.26fc20fa.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.26fc20fa.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--main26fc20fajsmap_A54A2CEA will be created
  + resource "aws_s3_object" "cloudWebsite_File--static--js--main26fc20fajsmap_A54A2CEA" {
      + acl                    = "private"
      + bucket                 = "cloud-website-c8e58765-20230803215115368500000001"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/static/js/main.26fc20fa.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/github/workspace/website/build/static/js/main.26fc20fa.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsLICENSEtxt_CF173BC8 will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsLICENSEtxt_CF173BC8 is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--mainf4c8898cjsLICENSEtxt_CF173BC8" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "9c8e4c8f13866e428a080abb8417edd2" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.f4c8898c.js.LICENSE.txt" -> null
      - key                    = "/static/js/main.f4c8898c.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.f4c8898c.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjs_7B16084A will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjs_7B16084A is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--mainf4c8898cjs_7B16084A" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript; charset=utf-8" -> null
      - etag                   = "d0c3c52dc80dacad519d5fe34f46ecce" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.f4c8898c.js" -> null
      - key                    = "/static/js/main.f4c8898c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.f4c8898c.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsmap_0538E57B will be destroyed
  # (because aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsmap_0538E57B is not in configuration)
  - resource "aws_s3_object" "cloudWebsite_File--static--js--mainf4c8898cjsmap_0538E57B" {
      - acl                    = "private" -> null
      - bucket                 = "cloud-website-c8e58765-20230803215115368500000001" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/json; charset=utf-8" -> null
      - etag                   = "a715ab2f06e877e838e5b71c6b887121" -> null
      - force_destroy          = false -> null
      - id                     = "/static/js/main.f4c8898c.js.map" -> null
      - key                    = "/static/js/main.f4c8898c.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/github/workspace/website/build/static/js/main.f4c8898c.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

Plan: 7 to add, 4 to change, 7 to destroy.

```

</details>
